cases/2D-heat-conduction-on-a-3-by-3-mesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    topInsulatedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3;
        startFace       12;
    }
    bottomInsulatedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3;
        startFace       15;
    }
    leftFixedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3;
        startFace       18;
    }
    rightFixedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3;
        startFace       21;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          18;
        startFace       24;
    }
)

// ************************************************************************* //
